# Pandas Day 5

## Why Multiple Datasets Exist 

In real-world applications, data is often stored in multiple datasets instead of a single table.

- Different datasets store different types of information  
- Data is separated to avoid duplication  
- Datasets are connected using common keys (IDs)  
- This makes data easier to manage and update  

To analyze such data, we need to combine these datasets using concatenation or merge operations.

In [79]:
import pandas as pd

In [80]:
# Datasets we are going to use : 
employees = pd.read_csv('Datasets/employees.csv')  # Employees data 
departments = pd.read_csv('Datasets/departments.csv')  # Departments data 
salaries = pd.read_csv('Datasets/salaries.csv')  # Salaries data
attendance_jan = pd.read_csv('Datasets/attendance_jan.csv')  # Attendance of Jan 
attendance_feb = pd.read_csv('Datasets/attendance_feb.csv')  # Attendance of Feb

## Concatenation (Concat)

Concatenation is used to combine datasets with the same structure.

- Data is stacked row-wise or column-wise
- No keys are required
- Commonly used to combine similar datasets

In [81]:
# Concat Attendance of Jan and Feb 

# Row wise concatenation
attendance = pd.concat((attendance_jan,attendance_feb),)

attendance

   emp_id  days_present
0     101            22
1     102            20
2     103            23
3     104            21
0     101            20
1     102            18
2     105            22
3     106            19

In [82]:
# As you can see that there is index issues in row wise concatenation so to resolve this we'll reset the index 
attendance = pd.concat((attendance_jan,attendance_feb),ignore_index=True)

attendance

   emp_id  days_present
0     101            22
1     102            20
2     103            23
3     104            21
4     101            20
5     102            18
6     105            22
7     106            19

In [83]:
attendance.shape

(8, 2)

In [84]:
# Column wise concatenation 
attendance = pd.concat((attendance_jan,attendance_feb),axis=1)
attendance

   emp_id  days_present  emp_id  days_present
0     101            22     101            20
1     102            20     102            18
2     103            23     105            22
3     104            21     106            19

In [85]:
attendance.shape

(4, 4)

## Merge

Merge is used to combine datasets that are related by a common key.

- Data is joined using a shared column (ID)
- Useful when information is stored in separate tables
- Supports different join types such as inner, left, right, and outer

In [86]:
# Merging employee and department data using dept_id

df = pd.merge(employees,departments,on='dept_id')    #(first dataset , second dataset , on = "key")
df

   emp_id emp_name  dept_id department_name
0     101   Nikhil        1              IT
1     102     Aman        2              HR
2     103    Rohit        1              IT
3     104    Sahil        3         Finance
4     105    Kunal        2              HR
5     106     Ravi        1              IT

In [87]:
df.isnull().sum()

emp_id             0
emp_name           0
dept_id            0
department_name    0
dtype: int64

## Types of join in merge 
- Inner join 
- Outer join 
- Left join 
- Right join

In [88]:
# Inner join 
inner = pd.merge(employees,salaries,on="emp_id",how='inner')
inner

   emp_id emp_name  dept_id  salary
0     101   Nikhil        1   50000
1     102     Aman        2   45000
2     103    Rohit        1   55000
3     105    Kunal        2   48000

In [89]:
inner.shape

(4, 4)

In [90]:
# Outer join 
outer = pd.merge(employees,salaries,on='emp_id',how='outer')
outer

   emp_id emp_name  dept_id   salary
0     101   Nikhil        1  50000.0
1     102     Aman        2  45000.0
2     103    Rohit        1  55000.0
3     104    Sahil        3      NaN
4     105    Kunal        2  48000.0
5     106     Ravi        1      NaN

In [91]:
#Left join 
left = pd.merge(employees,salaries,on='emp_id',how='left',indicator=True)
left

   emp_id emp_name  dept_id   salary     _merge
0     101   Nikhil        1  50000.0       both
1     102     Aman        2  45000.0       both
2     103    Rohit        1  55000.0       both
3     104    Sahil        3      NaN  left_only
4     105    Kunal        2  48000.0       both
5     106     Ravi        1      NaN  left_only

In [92]:
#Right join 
right = pd.merge(employees,salaries,on='emp_id',how='right',indicator=True)
right

   emp_id emp_name  dept_id  salary _merge
0     101   Nikhil        1   50000   both
1     102     Aman        2   45000   both
2     103    Rohit        1   55000   both
3     105    Kunal        2   48000   both

## Keys and Relationships 

- A **primary key** uniquely identifies each record in a dataset  
- A **foreign key** connects records between two datasets  
- A **one-to-many relationship** exists when one record in a table is related to multiple records in another table  

Keys are used during merging to correctly link related datasets.

In [93]:
# Primary Key in departments
departments["dept_id"].is_unique

True

In [94]:
# Foreign Key in employees
employees["dept_id"].value_counts()

dept_id
1    3
2    2
3    1
Name: count, dtype: int64

In [95]:
# One to many relationship 
employees_dept = pd.merge(
    employees,
    departments,
    on="dept_id",
    how="left"
)

employees_dept

   emp_id emp_name  dept_id department_name
0     101   Nikhil        1              IT
1     102     Aman        2              HR
2     103    Rohit        1              IT
3     104    Sahil        3         Finance
4     105    Kunal        2              HR
5     106     Ravi        1              IT

In [96]:
# Saving merged file into a new csv file 
employees_dept.to_csv('Datasets/employees_dept.csv',index='False')

## Summary (Day 5)

- Learned why data is often stored across multiple datasets
- Combined datasets with the same structure using concatenation
- Performed both row-wise and column-wise concatenation
- Merged related datasets using common keys
- Practiced different join types (inner, left, right, outer)
- Understood keys and one-to-many relationships between tables
- Validated results after merging
- Saved the final merged dataset for further analysis